Catalogs/мегапрайсАлгоритмы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>мегапрайсАлгоритмы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАлгоритм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗамены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФильтр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстАлгоритма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьДанныеФильтра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНазначениеГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНазначениеПроизводителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНазначениеСвойства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АвтозаменыПодстрок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодстрокаПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодстрокаЗамены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение1С</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрацияДанныхИзИмпорта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеФильтра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючевыеСлова</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначитьГруппу</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеПроизводителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючевыеСлова</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначитьПроизводителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеСвойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючевыеСлова</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначитьСвойство</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/мегапрайсАлгоритмы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Объект.ТекстАлгоритма = Параметры.ТекстАлгоритма;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДиалогов()
	
	Элементы.ЗакладкаАлгоритм.Видимость = Объект.ИспользоватьАлгоритм;
	Элементы.ЗакладкаАвтозаменыПодстрок.Видимость = Объект.ИспользоватьЗамены;
	Элементы.ЗакладкаИсключенияИзИмпорта.Видимость = Объект.ИспользоватьФильтр;
	Элементы.ЗакладкаНазначениеГруппы.Видимость = Объект.ИспользоватьНазначениеГруппы;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДиалогов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОпций(Элемент)
	
	УстановитьВидимостьДиалогов();
	
КонецПроцедуры



//////////////////////////////////////////////////////////////////
//  Работа подсистемы АЛГОРИТМЫ

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ПоискСоответствий.Выгрузить(), Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура АлгоритмПроверить(Команда)
	
	Значение = АлгоритмЗначение;
	Выполнить(Объект.ТекстАлгоритма);
	АлгоритмРезультат = Значение;
	
КонецПроцедуры




&НаКлиенте
Процедура СложениеНаименования(Команда)
	
	Объект.ТекстАлгоритма = "Значение = Колонка1+" "+Колонка2;";
	
КонецПроцедуры

&НаКлиенте
Процедура ИгнорИмпортаСтроки(Команда)
	
	Объект.ТекстАлгоритма = "
	|Если Найти(Значение, ""Брак"") > 0 Тогда	
	|    Значение = Неопределено; 
    |КонецЕсли;";

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛидирующийНули(Команда)
	
	Объект.ТекстАлгоритма = "Значение = Формат(Число(Значение),""ЧЦ=12; ЧН=0; ЧВН=; ЧГ=""); //размер числа 12 сивмолов";

КонецПроцедуры

&НаКлиенте
Процедура УбратьПервоеСлово(Команда)
	
	ТекстАлгоритма = "
	|ПервыйПробел = Найти(Значение,"" "");
	|Если ПервыйПробел  > 0 Тогда
	|	Значение = Прав(Значение,СтрДлина(Значение)-ПервыйПробел);
	|	Значение = СокрЛП(Значение);
	|КонецЕсли;";

	Объект.ТекстАлгоритма = ТекстАлгоритма;
	
КонецПроцедуры

Функция глРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = " ")

	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр,Разделитель);
			
			Если Поз = 0 Тогда
				СтрокаВМассив = СокрЛП(Стр);

				МассивСтрок.Добавить(СтрокаВМассив);
				Возврат МассивСтрок;
			КонецЕсли;
			
			СтрокаВМассив = СокрЛП(Лев(Стр,Поз-1));
			
			МассивСтрок.Добавить(СтрокаВМассив);
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр,Разделитель);
			
			Если Поз = 0 Тогда
				СтрокаВМассив = СокрЛП(Стр);

				МассивСтрок.Добавить(СтрокаВМассив);
				Возврат МассивСтрок;
			КонецЕсли;
			
			СтрокаВМассив = СокрЛП(Лев(Стр,Поз-1));

			МассивСтрок.Добавить(СтрокаВМассив);
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура АлгоритмПолучитьСловоПоПорядку(Команда)
	
	ТекстАлгоритма = "
	|МассивКлючевыхСлов = глРазложитьСтрокуВМассивПодстрок(Значение);
	|Значение = СокрЛП(МассивКлючевыхСлов.Получить(0)); //0 - первое слово, 1 - второе и так далее";
	
	//МассивКлючевыхСлов = глРазложитьСтрокуВМассивПодстрок(Значение);
	//Значение = СокрЛП(МассивКлючевыхСлов.Получить(0)); //0 - первое слово, 1 - второе и так далее";

	 Объект.ТекстАлгоритма = ТекстАлгоритма;
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьДвойныеПробелы(Команда)
	
	ТекстАлгоритма = "
	|Значение = СтрЗаменить(Значение,"   "," ");
	|Значение = СтрЗаменить(Значение,"  "," ");";
	
	Объект.ТекстАлгоритма = ТекстАлгоритма;
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмУбратьСимволыСтроки(Команда) 
	
	ТекстАлгоритма = "
	|Значение = СтрЗаменить(Значение,""-""," ");
	|Значение = СтрЗаменить(Значение,""_""," ");
	|Значение = СтрЗаменить(Значение,""(""," ");	
	|Значение = СтрЗаменить(Значение,"")""," ");
	|Значение = СтрЗаменить(Значение,""/""," ");
	|Значение = СтрЗаменить(Значение,""\""," ");
	|Значение = СтрЗаменить(Значение,""[""," ");	
	|Значение = СтрЗаменить(Значение,""]""," ");
	|Значение = СтрЗаменить(Значение,"".""," ");
	|Значение = СтрЗаменить(Значение,"":""," ");
	|Значение = СтрЗаменить(Значение,"",""," ");
	|Значение = СтрЗаменить(Значение,"";""," ");
	|Значение = СтрЗаменить(Значение,""""," ");
	|Значение = СтрЗаменить(Значение,""*""," ");
	|Значение = СтрЗаменить(Значение,""=""," ");
	|Значение = СтрЗаменить(Значение,""%""," ");
	|Значение = СтрЗаменить(Значение,"">""," ");
    |Значение = СтрЗаменить(Значение,""<""," ");
	|Значение = СтрЗаменить(Значение,""~""," ");	
	|Значение = СтрЗаменить(Значение," ","");
	|Значение = СокрЛП(Значение);	
	|Значение = ВРег(Значение);";
	
	Объект.ТекстАлгоритма = ТекстАлгоритма;
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьВсеПослеСкобки(Команда)
	
	ТекстАлгоритма = "
	|НайтиЧислоСимвола = Найти(Значение,""("");
	|Если НайтиЧислоСимвола  > 0 Тогда
	|	Значение = Лев(Значение,НайтиЧислоСимвола-1);
	|	Значение = СокрЛП(Значение);
	|КонецЕсли;";

	Объект.ТекстАлгоритма = ТекстАлгоритма;
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьПереводСтроки(Команда)
	
	ТекстАлгоритма = "
	|Значение = СтрЗаменить(Значение,Символы.ПС," ");";

	Объект.ТекстАлгоритма = ТекстАлгоритма;
	
КонецПроцедуры
